


* editing source code
#+srcname: <name>
#+begin_src <language> <switches> <header arguments>
  <body>
#+end_src
#+results:


C-c C-c to evaluate current block and insert results
#+begin_src emacs-lisp
: (+ 1 8 3 4)
#+end_src

#+results:
: 16

good lord, refer to org-babel if you need more...
